Autodesk.Revit.DB.Fabrication.FabricationCustomDataType
An enumerated type listing all fabrication custom data value types.
Since:
2017 Subscription Update
Since:
2017 Subscription Update

Autodesk.Revit.DB.Fabrication.FabricationCustomDataType.Real
Real number data type.

Autodesk.Revit.DB.Fabrication.FabricationCustomDataType.Integer
Integer data type

Autodesk.Revit.DB.Fabrication.FabricationCustomDataType.Text
Text data type